amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/getBucketObjectVersions.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.getbucketobjectversions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:accessKeyId>AKIAIGURZM7GJ7TRO6KQ</urn:accessKeyId>
      <urn:secretAccessKey>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</urn:secretAccessKey>
      <urn:methodType>GET</urn:methodType>
      <urn:contentType>application/xml</urn:contentType>
      <urn:xAmzDate>true</urn:xAmzDate>
      <urn:bucketName>imagebucke1</urn:bucketName>
      <urn:uriRemainder>/?versions</urn:uriRemainder>
      <urn:bucketUrl>http://imagebucke1.s3.amazonaws.com</urn:bucketUrl>
      <urn:maxKeys>1000</urn:maxKeys>
   </soapenv:Body>
</soapenv:Envelope>